/*! js-core-loop.js © yamoo9.net, 2016 */

// if (조건 === 참) {
//    // 1회 실행
// }

// while
// while (조건 === 참) {
//    // 반복 실행
// }
// while(조건 === 참) {
//   // 코드 반복
// }

// do ~ while
// do {
//   // 코드 반복
// } while(조건 === 참);

// -----------------------------------

// DOM 스크립팅
// 반복 구문을 사용하여 DOM 객체 탐색 헬퍼 함수
// 문서객체모델의 Node에 대해 이해하고 있어야 한다.

// -----------------------------------
// 미션
// -----------------------------------
// 문서에서 .gnb ul 요소를 선택한 후,
// .gnb ul의 첫번째 자식 요소를 찾는다.
// 찾은 요소의 다음 인접한 형제 요소를
// 변수 .gnb_2nd_child에 참조한다.